<template>
  <div class="content">
    <h1>客户端限流说明（资源限额）</h1>
    <hr/>
    <hr/>
    <h2>支持类型</h2>
    <ul>
      <li>基于用户主体标识的配置</li>
      <li>基于客户端ID的配置</li>
      <li>基于用户主体+客户端ID的配置</li>
    </ul>
    <hr/>
    <h2>默认配置</h2>
    <p>比如，基于用户的配置，在新增配置的时候未设置用户名称，则默认应用于所有用户</p>
    <p>基于客户端ID的配置，新增的时候，未指定客户端ID，则应用于所有客户端</p>
    <hr/>
    <h2>配置优先级</h2>
    下面的展示中，数字越小，即越靠上的优先级越高，相同的用户名称或者客户端ID，优先级最高的配置生效，下面的未指定表示 默认配置
    <ol>
      <li>[用户+客户端ID] 指定用户名称并且指定客户端ID（优先级最高）</li>
      <li>[用户+客户端ID] 指定用户名称，未指定客户端ID</li>
      <li>[用户] 指定用户名称</li>
      <li>[用户+客户端ID] 未指定用户名称，但指定客户端ID</li>
      <li>[用户+客户端ID] 未指定用户名称，未指定客户端ID</li>
      <li>[用户] 未指定用户名称</li>
      <li>[客户端ID] 指定客户端ID</li>
      <li>[客户端ID] 未指定客户端ID（优先级最低）</li>
    </ol>
    <hr/>
    <h2>使用注意</h2>
    大多数集群一般没有开启认证，所以用户配置可能不支持，限流可以使用基于客户端ID的配置。但是对于优先级最低的："[客户端ID]
    未指定客户端ID"，默认对于所有客户端生效，万一速率配置过小，可能无意间影响生产业务，所以尽量避免默认配置。
    <hr/>
    <h2>查询</h2>
    查询默认配置，在查询项的输入框内，输入一个空格即可。
  </div>
</template>

<script>

export default {
  name: "ClientQuotaIntroduce",
};
</script>

<style scoped></style>
